In [1]:
import pandas as pd

data = {
    "Nom":["Ana","Toni","Clara","Silvia"],
    "Edat":[18,25,30,26],
    "Barri":["Born","Eixample","Cadiz", "Hospitalet"]
}

df = pd.DataFrame(data)

In [2]:
df

      Nom  Edat       Barri
0     Ana    18        Born
1    Toni    25    Eixample
2   Clara    30       Cadiz
3  Silvia    26  Hospitalet

# Crear columna nova

In [3]:
df["Salari"] = [30000,80000,12000,24000]

In [4]:
df

      Nom  Edat       Barri  Salari
0     Ana    18        Born   30000
1    Toni    25    Eixample   80000
2   Clara    30       Cadiz   12000
3  Silvia    26  Hospitalet   24000

In [5]:
df["Salari"] = df["Salari"] + 2000

In [6]:
df

      Nom  Edat       Barri  Salari
0     Ana    18        Born   32000
1    Toni    25    Eixample   82000
2   Clara    30       Cadiz   14000
3  Silvia    26  Hospitalet   26000

In [12]:
noms = df["Nom"]
noms

0       Ana
1      Toni
2     Clara
3    Silvia
Name: Nom, dtype: object

In [13]:
majors_de_25 = df[df["Edat"] > 25]
majors_de_25

      Nom  Edat       Barri  Salari
2   Clara    30       Cadiz   14000
3  Silvia    26  Hospitalet   26000

# Trabajar con DataFrames de Pandas 1
Crea un DataFrame llamado libros_df con la siguiente información sobre libros:

Los títulos son: "El Quijote", "Cien años de soledad", "La odisea"

Los autores son "Miguel de Cervantes", "Gabriel García Márquez", "Homero"

Los años de publicación son 1605, 1967, y -800, respectivamente.



Asegúrate de utilizar las columnas Titulo, Autor y Año.

In [16]:
libro_df = pd.DataFrame({
    "Titulo":["El Quijote", "Cien años de soledad", "La odisea"],
    "Autor":["Miguel de Cervantes", "Gabriel García Márquez", "Homero"],
    "Año":[1605,1967,-800]
    
})

In [17]:
libro_df

                 Titulo                   Autor   Año
0            El Quijote     Miguel de Cervantes  1605
1  Cien años de soledad  Gabriel García Márquez  1967
2             La odisea                  Homero  -800

# Trabajar con DataFrames de Pandas 2
Dado el DataFrame df con columnas Nombre, Edad y Ciudad, como se mostró en la lección, escribe un código para filtrar las filas que contienen personas de 25 años o más. Asegurate de guardar en el dataframe filtrado en una variable llamada: df_filtrado

Observación:

En estos ejercicios no tendrás el botón "Ejecutar código" por esta razón no podrás visualizar los datos generados. Si deseas visualizarlos podrás servirte de un cuaderno de Jupyter y luego probar el ejercicio con ayuda del botón: "Ejecutar pruebas"

In [18]:
data = {
    'Nombre': ['Ana', 'Luis', 'Carlos', 'Sara'],
    'Edad': [25, 30, 22, 27],
    'Ciudad': ['Madrid', 'Barcelona', 'Valencia', 'Bilbao']
}

df = pd.DataFrame(data)

In [19]:
df

   Nombre  Edad     Ciudad
0     Ana    25     Madrid
1    Luis    30  Barcelona
2  Carlos    22   Valencia
3    Sara    27     Bilbao

In [20]:
df_filtrado = df[df["Edad"] >= 25]

In [21]:
df_filtrado

  Nombre  Edad     Ciudad
0    Ana    25     Madrid
1   Luis    30  Barcelona
3   Sara    27     Bilbao

In [22]:
df["Edad_en_10_años"] = df["Edad"] + 10

In [23]:
df["Ciudad"] = df["Ciudad"].str.upper()

In [24]:
df

   Nombre  Edad     Ciudad  Edad_en_10_años
0     Ana    25     MADRID               35
1    Luis    30  BARCELONA               40
2  Carlos    22   VALENCIA               32
3    Sara    27     BILBAO               37

In [38]:

df['Es_Mayor_de_25'] = df['Edad'] >= 25

In [39]:
df

   Nombre  Edad     Ciudad  Edad_en_10_años  Es_Mayor_de_25
0     Ana    25     MADRID               35            True
1    Luis    30  BARCELONA               40            True
2  Carlos    22   VALENCIA               32           False
3    Sara    27     BILBAO               37            True